# frozen_string_literal: true

# Needed to compile native ruby extensions (e.g. rugged)
brew "cmake"

# GNU coreutils to ensure script compatibility
brew "coreutils"

# RST files rendering
brew "docutils"

# Used to extract metadata from debian packages
brew "dpkg"

# Used in EXIF sanitizer
brew "exiftool"

# Fuzzy-finding in dev-helper scripts, e.g. feature-flag
brew "fzf"

brew "git"
brew "git-lfs"

# GPG verification
# See https://gitlab.com/gitlab-org/gitlab-development-kit/-/merge_requests/2244
brew "gnupg"
brew "gpgme"

# Backend for MiniMagick
brew "graphicsmagick"

# Kerberos
brew "heimdal"

# Needed by charlock_holmes
brew "icu4c"

# Postgres client tooling and libraries for native extension
brew "libpq@17"

# See https://gitlab.com/gitlab-org/gitlab-development-kit/-/merge_requests/2823
brew "libssh2"

# Needed by canvas (provides cairo, pango, pixman)
brew "librsvg"

# Needed for Ruby's psych
brew "libyaml"

# Link checking in documents
brew "lychee"

brew "openssl@3"

brew "pkg-config"

# Test databases
brew "sqlite"

brew "yamllint"
